{
    "0": {
        "Title": "Paris 2024 Olympics: Nita Ambani’s white salwar suit is all about class and style",
        "Description": "Paris 2024 Olympics: In a stunning white salwar suit, Nita Ambani gave us fresh ethnic fashion goals.Paris 2024 Olympics: The Ambani family is slaying in Paris this year. The family took off to experience 2024 Olympics, and since then, our feeds have been flooded with their sartorial fashion. From keeping it minimal and chic to portraying Indian traditions in ethnics, the Ambani family is busy making fashion lovers scurry to take notes. Nita Ambani gave us fresh fashion goals in a stunning ethnic ensemble as she walked out in style. Nita Ambani, on Tuesday, drove our midweek blues far away as she stepped out in a stunning ethnic ensemble. Nita Ambani chose a white salwar suit and we cannot help but take notes. The white embellished salwar suit came embroidered in white threads throughout. The salwar featured a knee-length shrug decorated in silver threads, with intricate embroidery work. She teamed it with matching white ethnic trousers. Paparazzi clicked Nita Ambani stepping out, and called out her name – to which, Nita Ambani sported her bright smile and waved at the cameras before getting into her car. ALSO READ: Nita Ambani’s mehendi artist applies Olympic-themed henna to fans in Paris The video was shared by a fan page on Instagram, and soon the reel was flooded with likes and comments. Netizens loved Nita Ambani’s ethnic look and commented with clapping hands. Take a look at the video here. A post shared by Ambani Family (@ambani_update) Nita Ambani carried a matching white and silver bag and minimally accessorised her look. The bag featured silver glass details at the sides. Nita Ambani wore her tresses loose with a wavy curly look and a side part. In minimal makeup – nude eyeshadow, black eyeliner, black kohl, contoured cheeks, a shade of nude lipstick and a small bindi - Nita Ambani aced the ethnic look to perfection. Needless to say, we are busy taking notes from Nita Ambani on how to ace the perfect ethnic look. ALSO READ: Nita Ambani, in embroidered red suit, gets warm welcome at 2024 Paris Olympics event by Emmanuel Macron  ",
        "Image_Link": "https://images.hindustantimes.com/img/2024/08/06/550x309/nita_1722957242991_1722957259487.jpg",
        "Source": "Hindustan Times",
        "Source_Link": "https://www.hindustantimes.com/lifestyle/fashion/paris-2024-olympics-nita-ambani-s-white-salwar-suit-is-all-about-class-and-style-101722957225697.html"
    },
    "1": {
        "Title": "Taapsee Pannu on making statement in Paris with sarees: ‘For me, saree is my casual wear and my holiday wear’",
        "Description": "Actor Taapsee Pannu wonders why only cotton dresses find a mention in conversation around comfortable fashion, and not saree. She hopes to change it.Actor Taapsee Pannu has been turning heads in Paris with her stylish fashion choices. She's been rocking vibrant sarees on the streets, making a statement and showing off her love for traditional Indian attire. The actor believes that sarees shouldn't be limited to special events; instead, they should be celebrated and worn every day. Also read: Taapsee Pannu's refreshing saree looks to support husband Mathias Boe at Paris Olympics should inspire you. Pics The actor has turned her Instagram account into her personal diary to capture all her sartorial choices as she is in Paris to support her husband and Indian badminton coach Mathias Boe at the Olympic Games. And she is overwhelmed with all the love coming her way. In fact, taking a step forward, Taapsee recently collaborated with the brand, Suta, to launch a saree collection, which is named #TAPCollection. \"Regarding the Suta Association I think I discovered a new side of my personality. When I embraced wearing sarees and by sarees, I don’t mean the ones that people generally wear on a red carpets or special occasions or festivals, I’m talking about the daily wear sarees,” Taapsee said. The actor added, “I realised how a different side of my personality started showing when I wore those sarees and with time when I started liking what I saw in the mirror I slowly started getting more and more comfortable wearing those sarees”. A post shared by Taapsee Pannu (@taapsee) She wonders why only cotton dresses find a mention in conversation around comfortable fashion, and not saree. “When it is actually very comfortable, you should just know how to drape it and just be confident about it and extremely comfortable. It’s not even size specific. It’s not like you buy one dress which is a particular size and you have to make sure you fit in it,” Taapsee mentions. Giving words to her views, the actor shared, “Saree is a piece of cloth that can adjust to your size. No matter what size you are. It can suit any occasion. I don't really believe the fact that saree can be only worn for festivals, or red carpets or big occasions. For me, saree was casual wear, my holiday wear”. It is this love that has graduated into her association with a brand like Suta. “They want to make sure that modern women start embracing saree as their casual wear, and it doesn’t become that extra hectic piece of clothing that they save only for specific occasions. So first, I incorporated that in my life, I totally loved it. I validated it, and then I wanted to take a step ahead because I saw so much love coming my way with these sarees. When I wear and I put up a picture or when I dress up in a saree that I want to make sure I share this experience with everyone through this collection,” she concluded. A post shared by Taapsee Pannu (@taapsee) When it comes to work, Taapsee has back to back projects ready for release. She will be seen returning as Rani in the second part, Phir Aayi Hasseen Dillruba, which is scheduled to release on August 9 on Netflix. She will also be seen in Khel Khel Mein, which also stars Akshay Kumar, Ammy Virk, Fardeen Khan, and Vaani Kapoor. It will release in theatres on August 15.  ",
        "Image_Link": "https://images.hindustantimes.com/img/2024/08/06/550x309/taapsee_pannu_1722950090443_1722950090769.jpg",
        "Source": "Hindustan Times",
        "Source_Link": "https://www.hindustantimes.com/lifestyle/fashion/taapsee-pannu-on-making-statement-in-paris-with-sarees-for-me-saree-is-my-casual-wear-and-my-holiday-wear-101722949995595.html"
    },
    "2": {
        "Title": "Alia Bhatt's denim-on-denim look with a trendy twist is an everyday styling goal",
        "Description": "Alia Bhatt's denim-on-denim is paired with a contrasting top to add a bit of oomph to her outfit.Alia Bhatt stunned in a casual outfit, fusing timeless pieces with a contemporary personal touch. Her ensemble is a serious inspiration for a laid-back, everyday look. Her denim outfit is relaxed, yet has playful elements that wows and turns heads. A fashion diva in the truest sense, looks like she’s all set to make denim trending again. ALSO READ: Half-asleep Raha Kapoor melts internet's heart as she sits on mama Alia Bhatt's lap in cute new video   The 31-year-old actor wore a classic, timeless faded denim jacket. She added the twist of a bright neon-coloured cropped tank top. Exuding an effortlessly cool vibe with a retro and rebellious charm, her neon tank top is the statement piece of her denim ensemble. It added a pop of vibrant colour to her muted blues. Her flared jeans complemented her denim jacket well and balanced the outfit.  The Darlings actor accessorised with sunglasses and chic golden hoops. Her hair was tied in a tight messy bun, accentuating the on-the-go, breezy, and comfy vibe. With a pair of beige wedges and minimal makeup, she finished her look, perfecting her laid-back style. The actor demonstrated her styling game and effortlessly blended the classic timeless pieces with current trending elements. Alia's outfit is perfect for those looking to stay stylish and comfortable. A post shared by Viral Bhayani (@viralbhayani) ALSO READ: Mahesh Bhatt says Alia Bhatt was ‘just a mannequin’ in Student of the Year in an honest review of her performances Alia Bhatt was last seen in Karan Johar-helmed movie Rocky Aur Rani Kii Prem Kahani, sharing the screen with Ranveer Singh. She is gearing up for the release of her next movie Jigra, which will hit the theatres on October 11 this year. The actor also joined the YRF spy universe and will be seen in the movie Alpha next to Sharvari Wagh. ALSO READ: Alia Bhatt changed her ‘loud tone’ after marriage to put me at ease, says Ranbir Kapoor        ",
        "Image_Link": "https://images.hindustantimes.com/img/2024/08/06/550x309/alia_bhatt_1722945177494_1722945177730.jpg",
        "Source": "Hindustan Times",
        "Source_Link": "https://www.hindustantimes.com/lifestyle/fashion/alia-bhatts-denim-on-denim-look-with-a-trendy-twist-is-an-everyday-styling-goal-101722944019646.html"
    },
    "3": {
        "Title": "Shraddha Kapoor rocks method dressing with another stunning red look in classic lace midi dress. Guess how much it costs",
        "Description": "Shraddha Kapoor is back to slay with another eye-catching red look! This time, she's dazzling in a classic lace midi dress that is all elegance.Shraddha Kapoor is back, painting the town red with another promotional look for Stree 2. Following in the stylish footsteps of Janhvi Kapoor, Blake Lively, and many more, Shraddha is absolutely slaying the method dressing trend. Her back-to-back red outfits are a treasure trove of fashion inspiration for all her fans. Just a day ago, she turned heads in a red Ajrakh saree and this time, she effortlessly embraced her glam avatar in a stunning red midi dress, showcasing that she can pull off any look to perfection. As we eagerly await more of her promotional looks, let's dive into her recent appearance and take some fashion notes from this style queen. (Also read: Shraddha Kapoor's Street 2 look in stunning maroon Ajrakh saree and gorgeous long hair wins hearts. Her outfit costs…) Shraddha's dress is a masterclass in elegance, featuring a beautifully flattering square neckline, charming short puffed sleeves and a feminine fit-and-flare silhouette that elegantly falls to a chic midi-length hemline. The scene-stealing floral lace detailing adorning her dress elevated her look to new heights. With its perfect blend of colours and silhouettes, her outfit achieves the right balance of style and grace, embodying the essence of refined sartorial fashion. A post shared by Viral Bhayani (@viralbhayani) If you're a fan of Shraddha's look and want to add it to your wardrobe, we've got you covered. Her gorgeous dress is from Self-Portrait and costs £380, which is approximately ₹40,000. She accessorised her look with a pair of golden hoop statement earrings, stacked bracelets adorning her wrist, a ring on her finger, and a pair of white stiletto heels. Her makeup featured nude eyeshadow, mascara-coated lashes, defined brows, blushed cheeks, glowing highlighter, and a shade of nude lipstick. With her luscious tresses styled in soft curls and left loose in a side part, she perfectly finished off her chic look. Shraddha will next reprise her enigmatic role in Stree 2. While the first film focuses on the spirit of Stree, the sequel introduces a new antagonist, Sarkate, the evil entity responsible for turning Stree into a ghost. Rajkummar Rao, Pankaj Tripathi, Aparshakti Khurrana, and Abhishek Banerjee will also return in their roles. Stree 2 is set to release on August 15.  ",
        "Image_Link": "https://images.hindustantimes.com/img/2024/08/06/550x309/5a44ac10-989c-4f1b-ad95-f50a2e3d337f_1722938706823_1722938713229.jpg",
        "Source": "Hindustan Times",
        "Source_Link": "https://www.hindustantimes.com/lifestyle/fashion/shraddha-kapoor-rocks-method-dressing-with-another-stunning-red-look-in-classic-lace-midi-dress-guess-how-much-it-costs-101722937535190.html"
    },
    "4": {
        "Title": "National Handloom Day 2024: Mysore silk, Begumpuri, Kanjivaram to Chanderi, trending handloom sarees for your wardrobe",
        "Description": "Celebrate National Handloom Day 2024 with the trending handloom sarees. From Kanjivaram to Chanderi, these must-have styles blend tradition with modern eleganceNational Handloom Day is celebrated every year on August 7 to pay tribute to the handloom weavers in India and to showcase the country's rich handloom industry. The Indian handloom legacy dates back centuries and is as diverse as the dialects and cuisine of our country. Each region has a rich weaving legacy that continues to thrive with ancient weaving techniques and designs. Adorned by people since ancient times, the saree is the most iconic traditional garment in India. From becoming a cherished family heirloom to marking every auspicious moment in one's life, sarees hold extraordinary sentimental significance in South Asian culture. With the increasing focus on handlooms owing to their sustainability and longevity, handloom sarees have gained immense popularity. Owning a piece of handloom is like possessing a piece of heritage art that seamlessly blends traditions with functionality. (Also read: Jayanti Reddy’s interview: Insights on her latest collection, cultural roots and the future of traditional crafts ) Asha Patil, Founder, Banjara Kasuti shared with HT Lifestyle some stunning must-have handloom sarees that demonstrate India's vibrant cultural heritage: A post shared by Ami Patel (@stylebyami) Mysore silk saree uncontested prestigious status continues to exude regal elegance and unrivalled grandeur. Originally reserved for royalty and later extended to high-ranking individuals, this luxurious saree is now adorned by one and all. Despite the influx of various saree styles in the market, the Mysore silk saree's popularity and allure remain undiminished, owing to its enduring refinement and exceptional craftsmanship, along with its minimal maintenance requirement. The use of pure gold and silver threads not only enhances the beauty of the fabric but further promotes in its longevity, resulting in little to no fading of the vibrancy of the fabric. A key feature of these sarees is their longevity – the colours rarely fade due to the use of pure gold and silver threads. While considered a premium and delicate textile, it surprisingly requires minimal maintenance. The beauty of Mysore silk sarees is often further elevated through the incorporation of Kasuti embroidery, intricately woven pallus, and innovative colour combinations. These enhancements serve to underscore the saree's timeless appeal, seamlessly blending traditional aesthetics with contemporary tastes. Originating from Begumpur, a small West Bengal town, Begumpuri cotton sarees are crafted from pure cotton and feature bold colour combinations with contrasting borders – typically incorporating geometric patterns, drawing inspiration from the aesthetic of neighbouring Northeast Indian states. Known for their durability, Begumpuri sarees are well-suited for everyday wear and work environments and are capable of withstanding long, busy days. The weave's versatility is evident in its range of yarn counts, spanning from 60s (coarser cotton) to 100s (finer cotton). Hailing from Tamil Nadu, Kanjivaram sarees are the product of expert craftsmanship, showcasing the meticulous work of talented artisans. These luxurious garments are created using high-quality pure mulberry silk, renowned for its lustrous appearance. What truly sets Kanjivaram sarees apart is their elaborate ornamentation. Complex patterns and motifs are intricately woven directly into the fabric. This is accomplished using authentic silver or gold zari threads, contributing significantly to the saree's regal appearance. A post shared by Keerthy Suresh (@keerthysureshofficial) Originating from Madhya Pradesh, Chanderi sarees exemplify India's rich textile heritage, showcasing exquisite craftsmanship and delicate allure. These sarees captivate their audience with their hand-woven designs, shimmering texture, and intricate motifs, all meticulously crafted by skilled artisans. The mere mention of Chanderi sarees invokes images of regal elegance – reminiscent of a majestic past. Tracing back its roots in the Vedic era, Chanderi sarees carry profound cultural significance, deeply intertwined with Indian history. The weaving tradition, handed down through generations, stands as a testament to the enduring artistry of its creators. From Mughal times to the present, cotton Chanderi sarees have adapted to changing trends while maintaining their distinctive character. A post shared by Shraddha ✶ (@shraddhakapoor) Kalamkari sarees are highly regarded for their unique blend of traditional craftsmanship, artistic expression, and refined aesthetics. These garments stand out due to their handcrafted designs, which feature a rich tapestry of symbolic elements. The intricate patterns adorning Kalamkari sarees draw inspiration from a variety of sources, particularly ancient Indian mythology, such as gods, trees, flowers, animals, and birds. Kalamkari, an art form practised in two distinct styles (Machilipatnam and Srikalahasti) in Andhra Pradesh, has consistently enchanted and fascinated its admirers. Its widespread appeal stems from a combination of factors: vibrant colour palettes, diverse thematic choices, precise linework, meticulous detailing, and versatility across various fabrics. The saree, in particular, serves as an ideal medium for Kalamkari artistry, allowing artisans to meticulously handcraft intricate narratives, lush floral designs, and other decorative motifs. Bringing her expertise to the same, Aparna Thyagarajan, Chief Product Officer & Co-Founder, Shobitam, shared the latest trends in handloom sarees for your wardrobe. A symbol of luxury and unparalleled craftsmanship, the Banarasi is an heirloom treasure. Varanasi also known as Banaras has been a melting pot of domestic and International influences due to its history as an ancient trade route and trending tourist destination. Hence the design vocabulary of Banaras is beautifully diverse reflecting Mughal, Persian, Hindu, and other Asian influences. A contemporary Banarasi saree is a multicultural tapestry of heritage. Favoured by the Nawaabs of Lucknow, the elegance and beauty of an artisanal Chikankari are unmatched. The dense emboss-like hand embroidery on fabrics like chiffons and georgettes gives it a luxurious net-like appearance. With embellishments ranging from Mukeish work to meticulously woven paisleys to light and airy embroidery, Chikankari offers the perfect blend of minimalism and maximalism. The design aesthetics of ancient Ikat have a timeless appeal that resonates with fashion today. Ikkat involves a complex resist dyeing technique with precise mathematical calculations. With vibrant geometrical patterns, fluid designs, and striking appeal, Ikkat remains a top choice for statement dressing. A post shared by Rakul Singh (@rakulpreet) The contemporary appeal and breathability of the Linen saree make it a worthy candidate for all seasons. The distinct texture of the saree gives it a chic look. A versatile, perfect blend of style and comfort, these sarees are a sustainable choice that brings out one's true personality with endless styling possibilities.  ",
        "Image_Link": "https://images.hindustantimes.com/img/2024/08/06/550x309/82574ed9-f7c0-4cbf-9d63-0937edf97676_1722932483131_1722932486721.jpg",
        "Source": "Hindustan Times",
        "Source_Link": "https://www.hindustantimes.com/lifestyle/fashion/national-handloom-day-2024-mysore-silk-begumpuri-kanjivaram-to-chanderi-trending-handloom-sarees-for-your-wardrobe-101722930584165.html"
    },
    "5": {
        "Title": "Jayanti Reddy’s interview: Insights on her latest collection, cultural roots and the future of traditional crafts",
        "Description": "In this exclusive interview, Jayanti Reddy discusses her Nawabi-inspired collection, Hyderabad’s influence and the future of traditional crafts in fashion.Fashion evolves at a rapid pace, especially in the realm of traditional wear, where new trends emerge every season. Last week, we celebrated India Couture Week, which showcased mesmerising lehengas, ethnic drapes, traditional fabrics, and intricate craftsmanship. These stunning displays are definitely going to set the tone for the next wave of ethnic fashion trends. Jayanti Reddy's latest collection for Couture Week, 'Evocative Nawabi Canvas,' inspired by Hyderabad's rich heritage showcases a stunning fusion of culture, colour, and couture. (Also read: Fashion trends 2024: From florals to cultural motifs, must-have saree prints to elevate your summer wardrobe ) Reddy reimagines Benarasi ensembles with a modern twist and introduces the beauty of Gota work for the first time. In the exclusive interview with HT Lifestyle, she shares insights into her creative process, the influence of Hyderabad's cultural heritage, and her commitment to keeping traditional crafts relevant in contemporary fashion. Jayanti Reddy's India Couture Week collection is a cornucopia of culture and colour, couture and poetry. There's something for every style sensibility- from capes and jackets to corsets and lehengas, along with delicate pearl, beads and Zardozi embroidery. Also, one of the key highpoints is a whole section of Benarasi ensembles reimagined with a modern twist. A post shared by Jayanti Reddy (@jayantireddylabel) Besides the Nizami influences, the collection's colours and textiles have also been inspired by my personal collection of heirlooms and antique textiles. The key JR silhouettes like the signature double draped sarees and the Khada dupatta inspired by the Nizami folklore take on singular silhouettes this season. The age-old zari/zardosi technique has always informed our collection and in this couture showcase, we've attempted to reconcile our characteristic elegance with couture spirit. For the first time, I've also explored the beauty of the intricate Gota work infusing it with a touch of luxe. A post shared by Jayanti Reddy (@jayantireddylabel) Today's well-travelled Indian consumer is aware of the global trends and is willing to experiment. The new age bride wants to blend traditions with contemporary styles and hence for a designer like me, it's an exciting time to be part of the fashion ecosystem. The designer, for the first time, extrapolates the beauty of the intricate Gota work, infusing the handcrafted intricate work that never fails to provide a touch of luxury. A post shared by Jayanti Reddy (@jayantireddylabel) The fusion of Western styles with traditional Indian wear opens up exciting opportunities. Our collection features capes, corsets, jackets, sari gowns, and lehenga skirts, complemented by our signature khada dupattas and double-border saris. Each piece, crafted with Banarasi textiles, antique motifs, and rich gota work, becomes a unique work of wearable art. Additionally, our menswear line includes reimagined classics like bandis, bandhgalas, sherwanis, and kurtas with a contemporary twist.  ",
        "Image_Link": "https://images.hindustantimes.com/img/2024/08/06/550x309/b28d118d-1fb0-4bc2-b98d-9f1f8f065023_1722922384852_1722922413207.jpg",
        "Source": "Hindustan Times",
        "Source_Link": "https://www.hindustantimes.com/lifestyle/fashion/jayanti-reddy-s-interview-insights-on-her-latest-collection-cultural-roots-and-the-future-of-traditional-crafts-101722920912621.html"
    }
}